BEGIN;

DROP TABLE IF EXISTS stocks CASCADE;
CREATE TABLE stocks
(
    id           BIGSERIAL PRIMARY KEY,
    title        VARCHAR(255),
    price        BIGINT,
    created_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP
);

INSERT INTO stocks(title, price, created_at)
VALUES ('Газпром', 1, '2020-09-07'),
       ('Газпром', 2, '2020-09-07'),
       ('Газпром 2', 2, '2020-09-07'),
       ('Газпром', 2222222, '2020-09-07'),
       ('Газпром 4', 2, '2020-09-07'),
       ('Газпром 5', 2, '2020-09-07'),
       ('Газпром 6', 2, '2020-09-07'),
       ('Газпром 7', 8, '2020-09-07'),
       ('Газпром 8', 2, '2020-09-07'),
       ('Газпром 9', 2, '2020-09-07'),
       ('Автоваз', 7, '2020-09-07'),
       ('Автоваз 1', 2, '2020-09-07'),
       ('Автоваз 2', 22222222, '2020-09-07'),
       ('Автоваз 3', 2, '2020-09-07'),
       ('Автоваз 4', 2, '2020-09-07'),
       ('Сбербанк', 2, '2020-09-07'),
       ('Сбербанк 1', 2, '2020-09-07'),
       ('Сбербанк 2', 2, '2020-09-07'),
       ('Сбербанк 3', 2, '2020-09-07'),
       ('Сбербанк 4', 2, '2020-09-07'),
       ('Сбербанк 5', 2, '2020-09-07'),
       ('Сбербанк 6', 2, '2020-09-07'),
       ('Сбербанк 7', 2, '2020-09-07');

COMMIT;